app/Models/ModelAgenda.php

   public function AllData()
   {
        return $this->db->table('tbl_agenda')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_agenda`

   public function InsertData($data)
   {
        $this->db->table('tbl_agenda')->insert($data);
---
INSERT INTO `tbl_agenda` (`nama_kegiatan`, `tanggal`, `jam`) VALUES ('gi', '2024-05-22', '17:46')