app/Models/ModelJemaat.php

SELECT *
FROM `tbl_jemaat`
---
   public function AllData()
   {
        return $this->db->table('tbl_jemaat')
        ->get()->getResultArray();