app/Models/ModelPendeta.php

SELECT *
FROM `tbl_p_pendeta`
---
   public function AllData()
   {
        return $this->db->table('tbl_p_pendeta')
                        ->get()
                        ->getResultArray();

INSERT INTO `tbl_p_pendeta` (`nama`, `jabatan`, `keterangan`, `foto`) VALUES ('j', 'h', 'i', '8_1.jpg')
---
   public function InsertData($data)
   {
        return $this->db->table('tbl_p_pendeta')->insert($data);