app/Models/ModelJadwal.php

   public function AllData()
   {
        return $this->db->table('tbl_jadwal_ibadah')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_jadwal_ibadah`